RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
/*
  ESP32_Obstaculos_OpenMV
  Obstaculos para el robot de India con camara OpenMV.

  Es gemelo de los programas HuskyLens: conserva la misma ley de control,
  los mismos pines del robot y una sola orden de servo y motor por ciclo.
  La unica diferencia importante es la camara: OpenMV envia por UART el ID,
  la posicion y el area del pilar detectado.

  Formato compatible con OPENMV/color_corner.py:
    ID,X,Y,AREA,ROI,COLISION,PARED_NEGRA[,PARKING,X_PARKING,AREA_PARKING]\n
    ID 3 = verde, ID 5 = rojo, ID 0 = sin pilar.
    X llega normalizada de -100 (izquierda) a 100 (derecha).

  Cableado UART2 a 3.3 V:
    OpenMV TX -> FireBeetle D2 / GPIO25 (RX)
    OpenMV RX <- FireBeetle D3 / GPIO26 (TX, opcional)
    OpenMV GND -- FireBeetle GND

  El Nano de ultrasonicos y el BNO085 siguen en I2C IO21/IO22 a 50 kHz.
  La camara usa UART a 19200 baudios y no comparte el bus I2C.
*/

#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_BNO08x.h>
#include <Preferences.h>
#include <ctype.h>
#include <string.h>
#include <math.h>

// ====================================================================
//                  VARIABLES PARA CALIBRAR EL ROBOT
// ====================================================================

// Los Kp del pasillo y de la camara se ajustan aqui. Despues hay que volver
// a cargar el programa al ESP32. Ningun valor guardado en la memoria puede
// reemplazarlos. Los demas parametros conservan sus ajustes opcionales por
// monitor serie.

// ------------------------- Velocidad --------------------------------

// Arath rueda al 40 %. La V2 de India rueda al 70 %, pero esa velocidad
// esta calibrada contra sus maniobras de rescate, que aqui no existen.
// Confirma la trayectoria a 40 y sube de cinco en cinco.
constexpr uint8_t VELOCIDAD_DEFECTO = 70;

// El sentido fisico del motor de este robot sale invertido.
constexpr bool INVERTIR_DIRECCION_MOTOR = true;

// ---------------------- Direccion por pasillo -----------------------

// diferencia = (S1 + S2) - (S4 + S5), en centimetros.
// S1 y S2 miran a la izquierda, S4 y S5 a la derecha.
//
// Control P del pasillo:
//   error = izquierda - derecha
//   correccion = Kp * error
// Arath: angulo = 90 - 0.18 * error, con tope de 18 grados.
constexpr float KP_PASILLO = 4.0f;  // <--- AJUSTAR KP DE PASILLO AQUI
constexpr float TOPE_PASILLO_DEFECTO = 30.0f;

// Cambiar a 1 si el robot se pega a la pared en vez de separarse.
constexpr int8_t DIRECCION_SERVO_PASILLO = -1;

// Recorte de los laterales antes de restar. Ver la nota del encabezado.
constexpr float MAXIMA_DISTANCIA_LATERAL_CM = 150.0f;

// ----------------------- Direccion por camara -----------------------

// OpenMV envia X normalizada entre -100 y 100. El objetivo 62.5 y Kp 0.20
// producen el mismo angulo que objetivo 200 y Kp 0.0625 en HuskyLens 2.
// Rojo a la izquierda de la imagen -> el robot pasa por la derecha.
constexpr float OBJETIVO_X_DEFECTO = 35.0f;
constexpr float KP_CAMARA = 1.0f;  // <--- AJUSTAR KP DE CAMARA AQUI
constexpr float TOPE_CAMARA_DEFECTO = 30.0f;

// Cambiar a -1 si el robot rebasa por el lado equivocado.
constexpr int8_t DIRECCION_SERVO_CAMARA = 1;

// IDs enviados por OPENMV/color_corner.py.
constexpr uint8_t ID_ROJO = 5;
constexpr uint8_t ID_VERDE = 3;

// El firmware OpenMV ya filtra blobs pequenos. Este segundo filtro evita
// usar como objetivo una deteccion con area casi nula.
constexpr uint16_t AREA_MINIMA_PILAR_PX = 30;

// --------------------------- Mision ---------------------------------

constexpr uint8_t ESQUINAS_PARA_TERMINAR = 12;  // 3 vueltas
constexpr float GRADOS_POR_ESQUINA = 90.0f;

// Arath cruza la linea de meta y sigue 250 ms antes de frenar.
constexpr unsigned long MILISEGUNDOS_TRAMO_FINAL = 250;

// ------------------------ Ritmo del ciclo ---------------------------

// 40 Hz. OpenMV se recibe sin bloquear por UART y el paquete del Nano tarda
// unos 2 ms, asi que el ciclo cierra con margen de sobra.
constexpr unsigned long PERIODO_CICLO_MS = 25;

// ====================================================================
//                             PINES
// ====================================================================

constexpr uint8_t PIN_SERVO = 27;  // D4 / IO27
constexpr uint8_t PIN_MOTOR_PWM = D6;
constexpr uint8_t PIN_MOTOR_AIN2 = D7;
constexpr uint8_t PIN_MOTOR_AIN1 = D8;
constexpr uint8_t PIN_ENCODER_A = D5;

constexpr int8_t PIN_OPENMV_RX = 25;  // D2, recibe desde TX de OpenMV
constexpr int8_t PIN_OPENMV_TX = 26;  // D3, envia hacia RX de OpenMV

constexpr uint8_t PIN_SDA = 21;
constexpr uint8_t PIN_SCL = 22;

constexpr uint8_t DIRECCION_NANO = 0x08;
constexpr uint8_t DIRECCION_BNO085_PRIMARIA = 0x4B;
constexpr uint8_t DIRECCION_BNO085_SECUNDARIA = 0x4A;

// El bus va a 50 kHz por el Nano de 5 V: sus pull-ups son de 3.3 V y el
// margen de HIGH es de apenas 0.3 V. Ver extras/README_I2C_SENSORES.md.
constexpr uint32_t FRECUENCIA_I2C_HZ = 50000;
constexpr uint16_t TIMEOUT_I2C_MS = 10;

constexpr uint32_t OPENMV_BAUD = 19200;
constexpr unsigned long OPENMV_TIMEOUT_MS = 500;
constexpr int OPENMV_X_MIN = -100;
constexpr int OPENMV_X_MAX = 100;
constexpr int OPENMV_X_TOLERANCIA = 5;
constexpr int OPENMV_ALTO_IMAGEN_PX = 240;
constexpr int OPENMV_CAMPOS_MINIMOS = 6;
constexpr int OPENMV_CAMPOS_MAXIMOS = 10;
constexpr size_t OPENMV_LINEA_BYTES = 128;
constexpr size_t OPENMV_BUFFER_RX_BYTES = 512;
constexpr int OPENMV_MAXIMO_ATRASO_BYTES = 128;
constexpr uint8_t OPENMV_LINEAS_POR_CICLO = 8;
constexpr unsigned long OPENMV_AVISO_INVALIDO_MS = 1000;

// ====================================================================
//                      CONSTANTES DE HARDWARE
// ====================================================================

constexpr uint8_t CANTIDAD_SENSORES = 5;
constexpr uint8_t BYTES_PAQUETE = CANTIDAD_SENSORES * 2;
constexpr uint16_t DISTANCIA_INVALIDA_MM = 0xFFFF;
constexpr uint16_t DISTANCIA_SIN_ECO_MM = 2000;
constexpr unsigned long TIMEOUT_SENSORES_MS = 250;

constexpr uint8_t INDICE_IZQ_90 = 0;   // S1
constexpr uint8_t INDICE_IZQ_25 = 1;   // S2
constexpr uint8_t INDICE_FRONTAL = 2;  // S3
constexpr uint8_t INDICE_DER_25 = 3;   // S4
constexpr uint8_t INDICE_DER_90 = 4;   // S5

