RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
constexpr int SERVO_CENTRO_GRADOS = 90;
constexpr int SERVO_CORRECCION_MAXIMA_GRADOS = 40;
constexpr uint16_t SERVO_PULSO_MINIMO_US = 500;
constexpr uint16_t SERVO_PULSO_MAXIMO_US = 2500;
constexpr uint32_t SERVO_PWM_HZ = 50;
constexpr uint8_t SERVO_PWM_BITS = 16;
constexpr uint32_t MOTOR_PWM_HZ = 20000;
constexpr uint8_t MOTOR_PWM_BITS = 10;

#if ESP_ARDUINO_VERSION_MAJOR < 3
constexpr uint8_t CANAL_PWM_SERVO = 0;
constexpr uint8_t CANAL_PWM_MOTOR = 1;
#endif

// El interruptor del juez corta la potencia del motor, no la del ESP32. El
// PWM se prepara desde el encendido y la ronda arranca cuando el encoder
// confirma que el robot de verdad se movio.
constexpr uint32_t PULSOS_PARA_ARRANCAR = 4;

constexpr uint32_t BNO085_INTERVALO_REPORTE_US = 10000;
constexpr unsigned long BNO085_REINTENTO_MS = 1000;
constexpr unsigned long BNO085_SIN_DATOS_MS = 2000;
constexpr float MAXIMO_SALTO_RUMBO_GRADOS = 90.0f;

constexpr uint8_t BRILLO_LEDS_PORCENTAJE = 20;
constexpr unsigned long INTERVALO_BRILLO_MS = 2000;
constexpr unsigned long INTERVALO_TELEMETRIA_MS = 500;

constexpr uint8_t SERIAL_LINEA_BYTES = 48;

// Tope de bytes atendidos por ciclo: pegar un texto largo no debe retrasar
// los sensores ni el servo.
constexpr uint8_t SERIAL_BYTES_POR_CICLO = 32;

// Espacio propio para que los ajustes de OpenMV no se mezclen con los de
// HuskyLens 1 o 2.
constexpr char NVS_ESPACIO[] = "openmv";

// ====================================================================
//                       COMPROBACIONES EN FRIO
// ====================================================================

static_assert(VELOCIDAD_DEFECTO > 0 && VELOCIDAD_DEFECTO <= 100,
              "La velocidad va de 1 a 100");
static_assert(DIRECCION_SERVO_PASILLO == 1 || DIRECCION_SERVO_PASILLO == -1,
              "La direccion del pasillo solo puede ser 1 o -1");
static_assert(DIRECCION_SERVO_CAMARA == 1 || DIRECCION_SERVO_CAMARA == -1,
              "La direccion de la camara solo puede ser 1 o -1");
static_assert(TOPE_PASILLO_DEFECTO <= SERVO_CORRECCION_MAXIMA_GRADOS,
              "El tope del pasillo no cabe en el recorrido del servo");
static_assert(TOPE_CAMARA_DEFECTO <= SERVO_CORRECCION_MAXIMA_GRADOS,
              "El tope de la camara no cabe en el recorrido del servo");
static_assert(ID_ROJO != ID_VERDE, "Los IDs de color deben ser distintos");
static_assert(KP_PASILLO >= 0.0f, "Kp de pasillo no puede ser negativo");
static_assert(KP_CAMARA >= 0.0f, "Kp de camara no puede ser negativo");
static_assert(ESQUINAS_PARA_TERMINAR > 0, "Hacen falta esquinas que contar");
static_assert(PERIODO_CICLO_MS > 0, "El periodo del ciclo no puede ser 0");

// ====================================================================
//                             ESTADO
// ====================================================================

enum class Color : uint8_t { NINGUNO, ROJO, VERDE };

enum class Fase : uint8_t { ESPERANDO, RODANDO, TRAMO_FINAL, TERMINADO };

struct Pilar {
  Color color = Color::NINGUNO;
  float xCamara = 0.0f;  // normalizada: -100 izquierda, +100 derecha
  uint16_t areaPx = 0;
  int16_t yPx = -1;
  uint8_t roi = 0;
  uint8_t id = 0;
};

// Lo que se calibra en la mesa. Arranca en las constantes de arriba, se
// cambia por el monitor serie y, si se guarda, sobrevive al apagon. Va
// declarado aqui, antes de cualquier funcion, porque el IDE de Arduino
// genera los prototipos al principio del archivo.
struct Ajustes {
  float topePasillo = TOPE_PASILLO_DEFECTO;
  float topeCamara = TOPE_CAMARA_DEFECTO;
  float objetivoX = OBJETIVO_X_DEFECTO;
  uint8_t velocidad = VELOCIDAD_DEFECTO;
};

Adafruit_BNO08x bno085;
sh2_SensorValue_t valorBno085;
HardwareSerial openMVSerial(2);

Fase fase = Fase::ESPERANDO;
Pilar pilar;
Ajustes ajustes;
Preferences memoria;
bool telemetriaActiva = true;

uint16_t distanciasMm[CANTIDAD_SENSORES] = {
    DISTANCIA_SIN_ECO_MM, DISTANCIA_SIN_ECO_MM, DISTANCIA_SIN_ECO_MM,
    DISTANCIA_SIN_ECO_MM, DISTANCIA_SIN_ECO_MM};
unsigned long ultimoPaqueteMs = 0;
bool hayDistancias = false;

bool servoListo = false;
bool motorListo = false;
int ultimoAnguloEscrito = -1;
uint8_t ultimaVelocidadEscrita = 255;

volatile uint32_t pulsosEncoder = 0;

bool bno085Listo = false;
bool bno085ConRumbo = false;
float rumboAnteriorGrados = 0.0f;
float giroAcumuladoGrados = 0.0f;
uint8_t esquinas = 0;
unsigned long ultimoReintentoBnoMs = 0;
unsigned long ultimoCuadroBnoMs = 0;

bool camaraLista = false;
unsigned long ultimoPaqueteCamaraMs = 0;
unsigned long ultimoAvisoOpenMvMs = 0;
uint32_t tramasOpenMvValidas = 0;
uint32_t tramasOpenMvInvalidas = 0;
char lineaOpenMV[OPENMV_LINEA_BYTES];
size_t largoLineaOpenMV = 0;
bool descartandoLineaOpenMV = false;

unsigned long inicioRondaMs = 0;
unsigned long finTramoFinalMs = 0;
unsigned long ultimoCicloMs = 0;
unsigned long ultimoBrilloMs = 0;
unsigned long ultimaTelemetriaMs = 0;

char lineaSerial[SERIAL_LINEA_BYTES];
uint8_t largoLineaSerial = 0;

// ====================================================================
//                            UTILIDADES
// ====================================================================

float normalizarDelta(float gradosDelta) {
  while (gradosDelta > 180.0f) gradosDelta -= 360.0f;
  while (gradosDelta < -180.0f) gradosDelta += 360.0f;
  return gradosDelta;
}

float distanciaLateralCm(uint16_t distanciaMm) {
  const float cm = static_cast<float>(distanciaMm) / 10.0f;
  return cm > MAXIMA_DISTANCIA_LATERAL_CM ? MAXIMA_DISTANCIA_LATERAL_CM : cm;
}

// ====================================================================
//                          SERVO Y MOTOR
// ====================================================================

bool iniciarServo() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(PIN_SERVO, SERVO_PWM_HZ, SERVO_PWM_BITS);
#else
  ledcSetup(CANAL_PWM_SERVO, SERVO_PWM_HZ, SERVO_PWM_BITS);
  ledcAttachPin(PIN_SERVO, CANAL_PWM_SERVO);
  return true;
#endif
}

void escribirServo(int grados) {
  if (!servoListo) {
    return;
  }

  grados = constrain(grados, 0, 180);

  const uint32_t pulsoUs =
      SERVO_PULSO_MINIMO_US +
      (static_cast<uint32_t>(grados) *
       (SERVO_PULSO_MAXIMO_US - SERVO_PULSO_MINIMO_US)) /
          180UL;

  constexpr uint32_t PERIODO_US = 1000000UL / SERVO_PWM_HZ;
  constexpr uint32_t DUTY_MAXIMO = (1UL << SERVO_PWM_BITS) - 1UL;

  const uint32_t duty =
      (pulsoUs * DUTY_MAXIMO + PERIODO_US / 2UL) / PERIODO_US;

