RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(PIN_SERVO, duty);
#else
  ledcWrite(CANAL_PWM_SERVO, duty);
#endif
}

// Unico punto del programa que mueve el servo.
void aplicarDireccion(float grados) {
  grados = constrain(
      grados,
      static_cast<float>(SERVO_CENTRO_GRADOS -
                         SERVO_CORRECCION_MAXIMA_GRADOS),
      static_cast<float>(SERVO_CENTRO_GRADOS +
                         SERVO_CORRECCION_MAXIMA_GRADOS));

  const int redondeado = static_cast<int>(lroundf(grados));
  if (redondeado != ultimoAnguloEscrito) {
    escribirServo(redondeado);
    ultimoAnguloEscrito = redondeado;
  }
}

bool iniciarMotor() {
  pinMode(PIN_MOTOR_AIN1, OUTPUT);
  pinMode(PIN_MOTOR_AIN2, OUTPUT);
  digitalWrite(PIN_MOTOR_AIN1, LOW);
  digitalWrite(PIN_MOTOR_AIN2, LOW);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(PIN_MOTOR_PWM, MOTOR_PWM_HZ, MOTOR_PWM_BITS);
#else
  ledcSetup(CANAL_PWM_MOTOR, MOTOR_PWM_HZ, MOTOR_PWM_BITS);
  ledcAttachPin(PIN_MOTOR_PWM, CANAL_PWM_MOTOR);
  return true;
#endif
}

// Unico punto del programa que mueve el motor. Siempre hacia adelante:
// este programa no tiene reversas ni maniobras de rescate.
void aplicarMotor(uint8_t porcentaje) {
  if (!motorListo) {
    return;
  }

  porcentaje = constrain(porcentaje, 0, 100);

  if (porcentaje == 0) {
    digitalWrite(PIN_MOTOR_AIN1, LOW);
    digitalWrite(PIN_MOTOR_AIN2, LOW);
  } else {
    digitalWrite(PIN_MOTOR_AIN1, INVERTIR_DIRECCION_MOTOR ? LOW : HIGH);
    digitalWrite(PIN_MOTOR_AIN2, INVERTIR_DIRECCION_MOTOR ? HIGH : LOW);
  }

  if (porcentaje == ultimaVelocidadEscrita) {
    return;
  }

  constexpr uint32_t DUTY_MAXIMO = (1UL << MOTOR_PWM_BITS) - 1UL;
  const uint32_t duty =
      (static_cast<uint32_t>(porcentaje) * DUTY_MAXIMO + 50UL) / 100UL;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(PIN_MOTOR_PWM, duty);
#else
  ledcWrite(CANAL_PWM_MOTOR, duty);
#endif
  ultimaVelocidadEscrita = porcentaje;
}

void IRAM_ATTR pulsoEncoder() { pulsosEncoder = pulsosEncoder + 1; }

void iniciarEncoder() {
  pinMode(PIN_ENCODER_A, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(PIN_ENCODER_A), pulsoEncoder, RISING);
}

uint32_t leerPulsosEncoder() {
  noInterrupts();
  const uint32_t pulsos = pulsosEncoder;
  interrupts();
  return pulsos;
}

// ====================================================================
//                       ULTRASONICOS POR I2C
// ====================================================================

bool leerDistancias() {
  const uint8_t recibidos =
      Wire.requestFrom(static_cast<uint8_t>(DIRECCION_NANO),
                       static_cast<uint8_t>(BYTES_PAQUETE));

  if (recibidos != BYTES_PAQUETE) {
    while (Wire.available()) {
      Wire.read();
    }
    return false;
  }

  for (uint8_t i = 0; i < CANTIDAD_SENSORES; ++i) {
    const uint8_t bajo = Wire.read();
    const uint8_t alto = Wire.read();
    const uint16_t valor =
        static_cast<uint16_t>(bajo) | (static_cast<uint16_t>(alto) << 8);
    distanciasMm[i] =
        valor == DISTANCIA_INVALIDA_MM ? DISTANCIA_SIN_ECO_MM : valor;
  }

  return true;
}

void enviarBrilloLeds(uint8_t porcentaje) {
  Wire.beginTransmission(DIRECCION_NANO);
  Wire.write(static_cast<uint8_t>(constrain(porcentaje, 0, 100)));
  Wire.endTransmission();
}

// ====================================================================
//                         OPENMV POR UART
// ====================================================================

Color colorDeId(long id) {
  if (id == ID_ROJO) return Color::ROJO;
  if (id == ID_VERDE) return Color::VERDE;
  return Color::NINGUNO;
}

long limitarLong(long valor, long minimo, long maximo) {
  if (valor < minimo) return minimo;
  if (valor > maximo) return maximo;
  return valor;
}

// Separa una linea CSV numerica. Los campos posteriores al decimo se ignoran
// para no romper el enlace si el firmware agrega telemetria en el futuro.
int separarCamposOpenMV(const char *linea, long *campos, int capacidad) {
  int cantidad = 0;
  const char *cursor = linea;

  while (*cursor != '\0') {
    while (*cursor == ' ' || *cursor == '\t') ++cursor;
    if (*cursor == '\0') break;

    bool negativo = false;
    if (*cursor == '+' || *cursor == '-') {
      negativo = *cursor == '-';
      ++cursor;
    }
    if (*cursor < '0' || *cursor > '9') return -1;

    long valor = 0;
    uint8_t digitos = 0;
    while (*cursor >= '0' && *cursor <= '9') {
      if (digitos >= 9) return -1;
      valor = valor * 10L + static_cast<long>(*cursor - '0');
      ++digitos;
      ++cursor;
    }
    if (negativo) valor = -valor;
    if (cantidad < capacidad) campos[cantidad] = valor;
    ++cantidad;

    while (*cursor == ' ' || *cursor == '\t') ++cursor;
    if (*cursor == ',') {
      ++cursor;
    } else if (*cursor != '\0') {
      return -1;
    }
  }

  return cantidad;
}

bool procesarLineaOpenMV(const char *linea, unsigned long ahoraMs) {
  long campos[OPENMV_CAMPOS_MAXIMOS] = {0};
  const int recibidos =
      separarCamposOpenMV(linea, campos, OPENMV_CAMPOS_MAXIMOS);

  if (recibidos < OPENMV_CAMPOS_MINIMOS) return false;

  const long id = campos[0];
  const long x = campos[1];
  const long y = campos[2];
  const long area = campos[3];
  const long roi = campos[4];
  const long colision = campos[5];

  if ((id != 0 && id != ID_ROJO && id != ID_VERDE) ||
      roi < 0 || roi > 2 ||
      (colision != 0 && colision != ID_ROJO && colision != ID_VERDE)) {
    return false;
  }

  Pilar nuevo;
  if (id != 0) {
    if (x < OPENMV_X_MIN - OPENMV_X_TOLERANCIA ||
        x > OPENMV_X_MAX + OPENMV_X_TOLERANCIA ||
        y < 0 || y >= OPENMV_ALTO_IMAGEN_PX ||
        area < AREA_MINIMA_PILAR_PX || area > UINT16_MAX ||
        (roi != 1 && roi != 2)) {
      return false;
    }

    nuevo.color = colorDeId(id);
    nuevo.id = static_cast<uint8_t>(id);
    nuevo.xCamara = static_cast<float>(
        limitarLong(x, OPENMV_X_MIN, OPENMV_X_MAX));
    nuevo.yPx = static_cast<int16_t>(y);
    nuevo.areaPx = static_cast<uint16_t>(area);
    nuevo.roi = static_cast<uint8_t>(roi);
  }

  pilar = nuevo;
  ultimoPaqueteCamaraMs = ahoraMs;
  ++tramasOpenMvValidas;

  if (!camaraLista) {
    camaraLista = true;
    Serial.println("OpenMV: enlace UART establecido");
  }
  return true;
}

void avisarTramaOpenMvInvalida(unsigned long ahoraMs) {
  ++tramasOpenMvInvalidas;
  if (ahoraMs - ultimoAvisoOpenMvMs >= OPENMV_AVISO_INVALIDO_MS) {
    ultimoAvisoOpenMvMs = ahoraMs;
    Serial.println("AVISO: trama OpenMV invalida");
  }
}

void iniciarCamara() {
  openMVSerial.setRxBufferSize(OPENMV_BUFFER_RX_BYTES);
  openMVSerial.begin(OPENMV_BAUD, SERIAL_8N1,
                     PIN_OPENMV_RX, PIN_OPENMV_TX);
  Serial.print("OpenMV UART2 lista: RX GPIO");
  Serial.print(PIN_OPENMV_RX);
  Serial.print(", TX GPIO");
  Serial.print(PIN_OPENMV_TX);
  Serial.print(", ");
  Serial.print(OPENMV_BAUD);
  Serial.println(" baudios");
}

