RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
void actualizarCamara(unsigned long ahoraMs) {
  // Si se acumularon demasiados bytes, son imagenes viejas. Se descarta la
  // parte atrasada y se recupera el encuadre con la siguiente linea completa.
  if (openMVSerial.available() > OPENMV_MAXIMO_ATRASO_BYTES) {
    while (openMVSerial.available() > OPENMV_MAXIMO_ATRASO_BYTES) {
      openMVSerial.read();
    }
    largoLineaOpenMV = 0;
    descartandoLineaOpenMV = true;
  }

  uint8_t lineasAtendidas = 0;
  while (openMVSerial.available() > 0 &&
         lineasAtendidas < OPENMV_LINEAS_POR_CICLO) {
    const char entrada = static_cast<char>(openMVSerial.read());

    if (entrada == '\r') continue;

    if (entrada == '\n') {
      ++lineasAtendidas;
      if (!descartandoLineaOpenMV && largoLineaOpenMV > 0) {
        lineaOpenMV[largoLineaOpenMV] = '\0';
        if (!procesarLineaOpenMV(lineaOpenMV, ahoraMs)) {
          avisarTramaOpenMvInvalida(ahoraMs);
        }
      }
      largoLineaOpenMV = 0;
      descartandoLineaOpenMV = false;
      continue;
    }

    if (descartandoLineaOpenMV) continue;

    if (largoLineaOpenMV < OPENMV_LINEA_BYTES - 1) {
      lineaOpenMV[largoLineaOpenMV++] = entrada;
    } else {
      largoLineaOpenMV = 0;
      descartandoLineaOpenMV = true;
      avisarTramaOpenMvInvalida(ahoraMs);
    }
  }

  if (camaraLista &&
      ahoraMs - ultimoPaqueteCamaraMs > OPENMV_TIMEOUT_MS) {
    camaraLista = false;
    pilar = Pilar();
    Serial.println("AVISO: enlace OpenMV perdido; sigue control por pasillo");
  }
}

// ====================================================================
//                        BNO085 Y CONTEO
// ====================================================================

bool iniciarBnoEn(uint8_t direccion) {
  if (!bno085.begin_I2C(direccion, &Wire)) {
    return false;
  }
  if (!bno085.enableReport(SH2_GAME_ROTATION_VECTOR,
                           BNO085_INTERVALO_REPORTE_US)) {
    return false;
  }

  bno085Listo = true;
  ultimoCuadroBnoMs = millis();
  Serial.print("BNO085 listo en 0x");
  Serial.println(direccion, HEX);
  return true;
}

void iniciarBno() {
  if (iniciarBnoEn(DIRECCION_BNO085_PRIMARIA) ||
      iniciarBnoEn(DIRECCION_BNO085_SECUNDARIA)) {
    return;
  }
  Serial.println("AVISO: BNO085 no detectado en 0x4B ni 0x4A");
}

void procesarRumbo(float rumboGrados, unsigned long ahoraMs) {
  ultimoCuadroBnoMs = ahoraMs;

  if (!bno085ConRumbo) {
    bno085ConRumbo = true;
    rumboAnteriorGrados = rumboGrados;
    return;
  }

  const float delta = normalizarDelta(rumboGrados - rumboAnteriorGrados);
  rumboAnteriorGrados = rumboGrados;

  // La ronda todavia no empieza: el giro acumulado arranca en cero cuando
  // el robot se mueve de verdad.
  if (fase != Fase::RODANDO) {
    return;
  }

  // Un solo cuadro con NaN dejaria el acumulado en NaN para siempre y con
  // el toda la mision.
  if (!isfinite(delta) || fabsf(delta) > MAXIMO_SALTO_RUMBO_GRADOS) {
    return;
  }

  giroAcumuladoGrados += delta;

  const uint8_t esquinasNuevas = static_cast<uint8_t>(
      floorf(fabsf(giroAcumuladoGrados) / GRADOS_POR_ESQUINA));

  if (esquinasNuevas > esquinas) {
    esquinas = min(esquinasNuevas, ESQUINAS_PARA_TERMINAR);
    Serial.print("Esquina ");
    Serial.print(esquinas);
    Serial.print("/");
    Serial.println(ESQUINAS_PARA_TERMINAR);
  }

  if (esquinas >= ESQUINAS_PARA_TERMINAR) {
    fase = Fase::TRAMO_FINAL;
    finTramoFinalMs = ahoraMs + MILISEGUNDOS_TRAMO_FINAL;
    Serial.println("3 vueltas completas: tramo final");
  }
}

void actualizarBno(unsigned long ahoraMs) {
  if (!bno085Listo) {
    if (ahoraMs - ultimoReintentoBnoMs >= BNO085_REINTENTO_MS) {
      ultimoReintentoBnoMs = ahoraMs;
      iniciarBno();
    }
    return;
  }

  // Contesta en I2C pero ya no manda cuaterniones. Reiniciarlo es la unica
  // salida: el conteo de vueltas depende por completo de el.
  if (ultimoCuadroBnoMs != 0 &&
      ahoraMs - ultimoCuadroBnoMs >= BNO085_SIN_DATOS_MS) {
    Serial.println("BNO085 sin datos: se reinicia");
    bno085Listo = false;
    bno085ConRumbo = false;
    ultimoReintentoBnoMs = ahoraMs;
    return;
  }

  if (bno085.wasReset()) {
    bno085ConRumbo = false;
    if (!bno085.enableReport(SH2_GAME_ROTATION_VECTOR,
                             BNO085_INTERVALO_REPORTE_US)) {
      bno085Listo = false;
      return;
    }
  }

  while (bno085.getSensorEvent(&valorBno085)) {
    if (valorBno085.sensorId != SH2_GAME_ROTATION_VECTOR) {
      continue;
    }

    const float qr = valorBno085.un.gameRotationVector.real;
    const float qi = valorBno085.un.gameRotationVector.i;
    const float qj = valorBno085.un.gameRotationVector.j;
    const float qk = valorBno085.un.gameRotationVector.k;
    const float rumbo = atan2f(2.0f * (qi * qj + qk * qr),
                               qi * qi - qj * qj - qk * qk + qr * qr) *
                        RAD_TO_DEG;
    procesarRumbo(rumbo, ahoraMs);
  }
}

// ====================================================================
//                       LEY DE DIRECCION
// ====================================================================

// Centrarse entre las dos paredes. Es la ley de Arath con el centro en 90.
float anguloPorPasillo() {
  const float izquierda = distanciaLateralCm(distanciasMm[INDICE_IZQ_90]) +
                          distanciaLateralCm(distanciasMm[INDICE_IZQ_25]);
  const float derecha = distanciaLateralCm(distanciasMm[INDICE_DER_25]) +
                        distanciaLateralCm(distanciasMm[INDICE_DER_90]);

  const float correccion =
      constrain(KP_PASILLO * (izquierda - derecha),
                -ajustes.topePasillo, ajustes.topePasillo);

  return static_cast<float>(SERVO_CENTRO_GRADOS) +
         static_cast<float>(DIRECCION_SERVO_PASILLO) * correccion;
}

// Empujar el pilar al costado que corresponde y sostenerlo ahi.
// Rojo: queda a la izquierda de la imagen, el robot pasa por la derecha.
// Verde: queda a la derecha de la imagen, el robot pasa por la izquierda.
float anguloPorCamara() {
  const float objetivo =
      pilar.color == Color::ROJO ? -ajustes.objetivoX : ajustes.objetivoX;

