RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
  const float correccion =
      constrain(KP_CAMARA * (pilar.xCamara - objetivo),
                -ajustes.topeCamara, ajustes.topeCamara);

  return static_cast<float>(SERVO_CENTRO_GRADOS) +
         static_cast<float>(DIRECCION_SERVO_CAMARA) * correccion;
}

// ====================================================================
//                    AJUSTES POR EL MONITOR SERIE
// ====================================================================

// Los demas parametros se pueden cambiar en caliente a 115200 baudios.
// Los dos Kp no aparecen como comandos: se cambian unicamente en la lista
// superior.
//
//   ver            muestra los valores actuales
//   tope 25        tope de correccion del pasillo, en grados
//   topecam 20     tope de correccion de la camara, en grados
//   objx 200       donde debe quedar el pilar, en pixeles desde el centro
//   vel 45         velocidad del motor, en por ciento
//   tel 0          calla la telemetria para poder escribir; tel 1 la vuelve
//   guardar        graba los valores actuales en la memoria del ESP32
//   reset          vuelve a los valores de compilacion, SIN guardar
//
// Los cambios son inmediatos pero VOLATILES: sin "guardar", el siguiente
// encendido vuelve a lo ultimo guardado. Eso es a proposito, para que un
// experimento malo no se quede pegado.
//
// Leer el serie no toca el camino de control: cambia parametros, no manda
// al servo. La regla de una escritura por ciclo sigue intacta.

void mostrarAjustes() {
  Serial.println("--- ajustes ---");
  Serial.print("  kp      ");
  Serial.print(KP_PASILLO, 3);
  Serial.println(" (se cambia en el codigo)");
  Serial.print("  kp cam  ");
  Serial.print(KP_CAMARA, 4);
  Serial.println(" (se cambia en el codigo)");
  Serial.print("  tope    ");
  Serial.println(ajustes.topePasillo, 1);
  Serial.print("  topecam ");
  Serial.println(ajustes.topeCamara, 1);
  Serial.print("  objx    ");
  Serial.println(ajustes.objetivoX, 0);
  Serial.print("  vel     ");
  Serial.println(ajustes.velocidad);
}

void cargarAjustes() {
  // En modo lectura, begin() falla si todavia no se ha guardado nada.
  if (!memoria.begin(NVS_ESPACIO, true)) {
    Serial.println("Sin ajustes guardados: se usan los de compilacion");
    return;
  }

  ajustes.topePasillo = memoria.getFloat("tope", TOPE_PASILLO_DEFECTO);
  ajustes.topeCamara = memoria.getFloat("topecam", TOPE_CAMARA_DEFECTO);
  ajustes.objetivoX = memoria.getFloat("objx", OBJETIVO_X_DEFECTO);
  ajustes.velocidad = memoria.getUChar("vel", VELOCIDAD_DEFECTO);
  memoria.end();

  Serial.println("Ajustes cargados de la memoria del ESP32");
}

void guardarAjustes() {
  if (!memoria.begin(NVS_ESPACIO, false)) {
    Serial.println("ERROR: no se pudo abrir la memoria");
    return;
  }

  memoria.putFloat("tope", ajustes.topePasillo);
  memoria.putFloat("topecam", ajustes.topeCamara);
  memoria.putFloat("objx", ajustes.objetivoX);
  memoria.putUChar("vel", ajustes.velocidad);
  memoria.end();

  Serial.println("Ajustes guardados");
}

// True si la linea empieza con el nombre y un espacio. El espacio importa:
// sin el, "tope" se comeria "topecam".
bool leerComando(const char *linea, const char *nombre, float &valor) {
  const size_t largo = strlen(nombre);

  if (strncmp(linea, nombre, largo) != 0 || linea[largo] != ' ') {
    return false;
  }

  valor = atof(linea + largo + 1);
  return true;
}

void aplicarComando(const char *linea) {
  float valor = 0.0f;

  if (strcmp(linea, "ver") == 0) {
    mostrarAjustes();
    return;
  }

  if (strcmp(linea, "guardar") == 0) {
    guardarAjustes();
    return;
  }

  if (strcmp(linea, "reset") == 0) {
    ajustes = Ajustes();
    Serial.println("Valores de compilacion restaurados, sin guardar");
    mostrarAjustes();
    return;
  }

  if (leerComando(linea, "tel", valor)) {
    telemetriaActiva = valor != 0.0f;
    Serial.println(telemetriaActiva ? "Telemetria encendida"
                                    : "Telemetria apagada");
    return;
  }

  if (leerComando(linea, "tope", valor)) {
    ajustes.topePasillo = constrain(
        valor, 0.0f, static_cast<float>(SERVO_CORRECCION_MAXIMA_GRADOS));
  } else if (leerComando(linea, "topecam", valor)) {
    ajustes.topeCamara = constrain(
        valor, 0.0f, static_cast<float>(SERVO_CORRECCION_MAXIMA_GRADOS));
  } else if (leerComando(linea, "objx", valor)) {
    ajustes.objetivoX =
        constrain(valor, 0.0f, static_cast<float>(OPENMV_X_MAX));
  } else if (leerComando(linea, "vel", valor)) {
    ajustes.velocidad = static_cast<uint8_t>(constrain(valor, 0.0f, 100.0f));
  } else {
    Serial.print("No entendi: ");
    Serial.println(linea);
    Serial.println("ver | tope | topecam | objx | vel | tel | "
                   "guardar | reset");
    return;
  }

  mostrarAjustes();
}

void atenderSerial() {
  uint8_t atendidos = 0;

  while (Serial.available() > 0 && atendidos < SERIAL_BYTES_POR_CICLO) {
    ++atendidos;
    const char entrada = static_cast<char>(Serial.read());

    if (entrada == '\r') {
      continue;
    }

    if (entrada == '\n') {
      lineaSerial[largoLineaSerial] = '\0';
      if (largoLineaSerial > 0) {
        aplicarComando(lineaSerial);
      }
      largoLineaSerial = 0;
      continue;
    }

    if (largoLineaSerial < SERIAL_LINEA_BYTES - 1) {
      lineaSerial[largoLineaSerial++] =
          static_cast<char>(tolower(static_cast<unsigned char>(entrada)));
    }
  }
}

// ====================================================================
//                          TELEMETRIA
// ====================================================================

void imprimirTelemetria(float angulo, uint8_t velocidad) {
  Serial.print("fase ");
  switch (fase) {
    case Fase::ESPERANDO:
      Serial.print("espera");
      break;
    case Fase::RODANDO:
      Serial.print("rodando");
      break;
    case Fase::TRAMO_FINAL:
      Serial.print("final");
      break;
    case Fase::TERMINADO:
      Serial.print("fin");
      break;
  }

  Serial.print(" | pilar ");
  switch (pilar.color) {
    case Color::ROJO:
      Serial.print("rojo");
      break;
    case Color::VERDE:
      Serial.print("verde");
      break;
    default:
      Serial.print("-");
      break;
  }

  Serial.print(" x ");
  Serial.print(pilar.xCamara, 0);
  Serial.print(" area ");
  Serial.print(pilar.areaPx);
  Serial.print(" cam ");
  Serial.print(camaraLista ? "ok" : "-");

  Serial.print(" | cm 90i ");
  Serial.print(distanciasMm[INDICE_IZQ_90] / 10);
  Serial.print(" 25i ");
  Serial.print(distanciasMm[INDICE_IZQ_25] / 10);
  Serial.print(" fr ");
  Serial.print(distanciasMm[INDICE_FRONTAL] / 10);
  Serial.print(" 25d ");
  Serial.print(distanciasMm[INDICE_DER_25] / 10);
  Serial.print(" 90d ");
  Serial.print(distanciasMm[INDICE_DER_90] / 10);

  Serial.print(" | servo ");
  Serial.print(angulo, 1);
  Serial.print(" motor ");
  Serial.print(velocidad);
  Serial.print(" | giro ");
  Serial.print(giroAcumuladoGrados, 0);
  Serial.print(" esquinas ");
  Serial.println(esquinas);
}

