RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_OpenMV.ino
// ====================================================================
//                          SETUP Y LOOP
// ====================================================================

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println();
  Serial.println("ESP32_Obstaculos_OpenMV");

  cargarAjustes();
  mostrarAjustes();

  servoListo = iniciarServo();
  aplicarDireccion(SERVO_CENTRO_GRADOS);

  motorListo = iniciarMotor();
  aplicarMotor(0);

  iniciarEncoder();

  Wire.begin(PIN_SDA, PIN_SCL, FRECUENCIA_I2C_HZ);
  Wire.setTimeOut(TIMEOUT_I2C_MS);

  iniciarBno();
  iniciarCamara();

  enviarBrilloLeds(BRILLO_LEDS_PORCENTAJE);
  ultimoBrilloMs = millis();
  ultimoCicloMs = millis();

  Serial.println("Listo. El motor arranca cuando el juez da potencia.");
}

void loop() {
  const unsigned long ahoraMs = millis();

  if (ahoraMs - ultimoCicloMs < PERIODO_CICLO_MS) {
    return;
  }
  ultimoCicloMs = ahoraMs;

  // ---------------- 1. percepcion ----------------

  actualizarCamara(ahoraMs);

  if (leerDistancias()) {
    ultimoPaqueteMs = ahoraMs;
    hayDistancias = true;
  } else if (hayDistancias &&
             ahoraMs - ultimoPaqueteMs > TIMEOUT_SENSORES_MS) {
    hayDistancias = false;
    Serial.println("AVISO: sin paquete del Nano");
  }

  actualizarBno(ahoraMs);

  // ---------------- 2. arranque de la ronda ----------------

  if (fase == Fase::ESPERANDO &&
      leerPulsosEncoder() >= PULSOS_PARA_ARRANCAR) {
    fase = Fase::RODANDO;
    inicioRondaMs = ahoraMs;
    giroAcumuladoGrados = 0.0f;
    esquinas = 0;
    Serial.println("Ronda iniciada");
  }

  if (fase == Fase::TRAMO_FINAL && ahoraMs >= finTramoFinalMs) {
    fase = Fase::TERMINADO;
    Serial.print("*** MISION TERMINADA en ");
    Serial.print((ahoraMs - inicioRondaMs) / 1000.0f, 1);
    Serial.println(" s ***");
  }

  // ---------------- 3. un angulo y una velocidad ----------------

  float angulo = SERVO_CENTRO_GRADOS;
  uint8_t velocidad = 0;

  if (fase == Fase::TERMINADO) {
    angulo = SERVO_CENTRO_GRADOS;
    velocidad = 0;
  } else if (!hayDistancias) {
    // Sin sensores el robot no sabe donde esta el pasillo. Frenar es la
    // unica respuesta honesta.
    angulo = SERVO_CENTRO_GRADOS;
    velocidad = 0;
  } else if (fase == Fase::TRAMO_FINAL) {
    // Cruzando la meta manda el pasillo: no hay que rebasar nada mas.
    angulo = anguloPorPasillo();
    velocidad = ajustes.velocidad;
  } else if (pilar.color != Color::NINGUNO) {
    angulo = anguloPorCamara();
    velocidad = ajustes.velocidad;
  } else {
    angulo = anguloPorPasillo();
    velocidad = ajustes.velocidad;
  }

  // ---------------- 4. las dos unicas escrituras ----------------

  aplicarDireccion(angulo);
  aplicarMotor(velocidad);

  // ---------------- 5. mantenimiento ----------------

  atenderSerial();

  if (ahoraMs - ultimoBrilloMs >= INTERVALO_BRILLO_MS) {
    ultimoBrilloMs = ahoraMs;
    enviarBrilloLeds(BRILLO_LEDS_PORCENTAJE);
  }

  if (telemetriaActiva &&
      ahoraMs - ultimaTelemetriaMs >= INTERVALO_TELEMETRIA_MS) {
    ultimaTelemetriaMs = ahoraMs;
    imprimirTelemetria(angulo, velocidad);
  }
}
